# class Fib:
#     def __init__(self, nn):                                                          #как происходит итерация 
#         print ("_init_")
#         self._n = nn
#         self._i = 0
#         self._p1 = self._p2 = 1
#     def __iter__(self):
#         print("_iter_")
#         return self
    
#     def __next__(self):
#         print("_self_")
#         self._i += 1
#         if self._i > self._n:
#             raise StopIteration
#         if self._i in [1, 2]:
#             return 1
#         ret = self._p1 + self._p2
#         self._p1, self._p2 = self._p2, ret
#         return ret
# for i in Fib(10):
#     print(i)                                                         #цифры скалдываются и какая сумма выходит плюсуется к прошлой общей

#--------------------------------------------------------------------------------------------------------------

# def fun(n):
#     for i in range(n):
#         yield i                                                #начало 
    

# for v in fun(5):                                               #значение которое сами поставим например (5) , значит цикл будет до с 0 до 4
#     print(v)

#--------------------------------------------------------------------------------------------------------------

# def powers0f2 (n):
#     pow = 1
#     for i in range(n):                                                  
#         yield pow
#         pow *=2                               # число с 1 умножиться на 2 и так по возрастанию , чтоб возводить в степень пишем две зведочки

# for v in powers0f2(8):
#     print(v)

#---------------------------------------------------------------------------------------------------------------

# def Fib(n):
#     p = pp = 1
#     for i in range(n):
#         if i in [0, 1]:
#             yield 1
#         else:
#             n = p+pp
#             pp, p = p, n
#             yield n                                                  
# fibs = list(Fib(10))                                               # 10 это сколько раз пройдет цикл
# print(fibs)                                                       #цифры скалдываются и какая сумма выходит плюсуется к прошлой общей
        
#------------------------------------------------------------------------------------------------------------------------

# two = lambda : 2
# sqr = lambda x : x * x
# pwr = lambda x, y : x ** y

# for a in range (-2, 3):                                 
#     print(sqr(a),end="")
#     print(pwr(a, two())) 

#------------------------------------------------------------------------------------------------------------------------

# list_number = [1, 2, 3, 4, 5, 6]
# my_list = list(map(lambda x: x * 2,list_number))                    # list это как int  то есть класс числа , map просто возврощает х (map полностью пробигает функцию и возврощает)


# print(list_number)                                        #первое обыч список
# print(my_list)                                            # уже идет умножение на 2 , все значения из обыч списка 


#---------------------------------------------------------------------------------------------------------------------------
# list_number = [1, 2, 3, 4, 5, 6]
# my_list = list(filter(lambda x: x % 2 == 0,list_number))                    # filter будет возврощать значение , если правдивое то вернет в список если нет то не вернет
#                                                                               # % эт деление остатка то есть 2%2 это 1 и он правдив и без остатка и сравнивается с 0

# print(list_number)                                        #первое обыч список
# print(my_list)       



